#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.resources.data.aws_availability_zones.available: Reading...
module.resources.module.cluster_autoscaler_irsa.data.aws_caller_identity.current: Reading...
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.resources.module.cluster_autoscaler_irsa.data.aws_region.current: Reading...
module.resources.module.cluster_autoscaler_irsa.data.aws_partition.current: Reading...
module.resources.aws_db_parameter_group.eoapi_postgres17: Refreshing state... [id=eoapi-postgres17-staging]
module.resources.aws_iam_user.langfuse: Refreshing state... [id=langfuse-staging-s3-user]
module.resources.aws_iam_user.requester_pays: Refreshing state... [id=eoapi-requester-pays-staging-user]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.resources.module.cluster_autoscaler_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.resources.module.cluster_autoscaler_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.resources.data.aws_db_instance.zeno-db: Reading...
module.resources.aws_s3_bucket.langfuse: Refreshing state... [id=langfuse-staging-bucket]
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_partition.current: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_caller_identity.current: Reading...
module.resources.module.cluster_autoscaler_irsa.data.aws_iam_policy_document.cluster_autoscaler[0]: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_partition.current: Read complete after 0s [id=aws]
module.resources.data.aws_caller_identity.current: Reading...
module.resources.module.cluster_autoscaler_irsa.data.aws_iam_policy_document.cluster_autoscaler[0]: Read complete after 0s [id=1225182836]
module.resources.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0233b677bf7586002]
module.resources.module.cluster_autoscaler_irsa.data.aws_caller_identity.current: Read complete after 1s [id=084375562450]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.resources.module.eks.module.eks_managed_node_group["regular"].data.aws_caller_identity.current: Read complete after 1s [id=084375562450]
module.resources.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.resources.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.resources.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.resources.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.resources.module.eks.data.aws_caller_identity.current: Reading...
module.resources.data.aws_caller_identity.current: Read complete after 1s [id=084375562450]
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.resources.module.eks.data.aws_partition.current: Reading...
module.resources.module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.resources.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.resources.module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/zeno-staging-cluster/cluster]
module.resources.module.eks.data.aws_caller_identity.current: Read complete after 0s [id=084375562450]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role.this[0]: Refreshing state... [id=regular-eks-node-group-20250423104012446300000001]
module.resources.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=084375562450]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20250423104012447200000003]
module.resources.data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.resources.module.eks.aws_iam_role.this[0]: Refreshing state... [id=zeno-staging-cluster-cluster-20250423104012446600000002]
module.resources.module.eks.data.aws_iam_session_context.current: Reading...
module.resources.module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::084375562450:user/tarashish@developmentseed.org]
module.resources.aws_iam_user_policy.requester_pays: Refreshing state... [id=eoapi-requester-pays-staging-user:requester-pays-staging-policy]
module.resources.data.aws_db_instance.zeno-db: Read complete after 1s [id=zeno-db]
module.resources.aws_iam_access_key.requester_pays: Refreshing state... [id=AKIARHJJM5DJA6Z5FJ3O]
module.resources.aws_iam_access_key.langfuse: Refreshing state... [id=AKIARHJJM5DJGRVTWKOR]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=regular-eks-node-group-20250423104012446300000001-2025042310401330780000000a]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=default-eks-node-group-20250423104012447200000003-20250423104013140300000005]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20250423104012447200000003-20250423104013267500000009]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20250423104012447200000003-20250423104013254500000007]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=regular-eks-node-group-20250423104012446300000001-2025042310401341840000000c]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=regular-eks-node-group-20250423104012446300000001-2025042310401331080000000b]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20250423104012447200000003-20250423104013264000000008]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=regular-eks-node-group-20250423104012446300000001-2025042310401343260000000d]
module.resources.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=zeno-staging-cluster-cluster-20250423104012446600000002-20250423104013137000000004]
module.resources.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=zeno-staging-cluster-cluster-20250423104012446600000002-20250423104013141400000006]
module.resources.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.resources.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4106847354]
module.resources.module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=9e945bfa-7af5-4c7a-aeea-c903ae9d7ceb]
module.resources.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ed8b0636d7d94689]
module.resources.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-041ed5a76f985e613]
module.resources.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-080c4a3dcb3b8052b]
module.resources.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0537c1494dcb98da7]
module.resources.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0b489d24e0ce75357]
module.resources.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-093dc828845e30d17]
module.resources.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06a71eea1358f008f]
module.resources.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0426fdcf27ef3a6cf]
module.resources.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-061f3f293ed2f3f5e]
module.resources.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0506d1fa3dd14a30d]
module.resources.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0aab8f574f4bd33a2]
module.resources.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f1544432f2a769d2]
module.resources.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06be7fcbfc68758ff]
module.resources.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-04591b309ac62bf35]
module.resources.module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/zeno-staging-cluster]
module.resources.aws_iam_user_policy.langfuse: Refreshing state... [id=langfuse-staging-s3-user:langfuse-staging-policy]
module.resources.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-094f6a6e2662b1bb8]
module.resources.module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::084375562450:policy/zeno-staging-cluster-cluster-ClusterEncryption20250423104036435700000013]
module.resources.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0506d1fa3dd14a30d1080289494]
module.resources.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-09bbbde80e6fb511a]
module.resources.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0276ddde804e58cfc]
module.resources.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f2dc967bed79f4f8]
module.resources.aws_db_subnet_group.eoapi: Refreshing state... [id=eoapi-staging]
module.resources.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-400054497]
module.resources.aws_security_group.eoapi_db: Refreshing state... [id=sg-05baefd9f9f1b7cd0]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1191288840]
module.resources.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1344566324]
module.resources.module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3009130306]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2054856278]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-547016993]
module.resources.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2933540329]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3006855616]
module.resources.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4101756891]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3301307946]
module.resources.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2690958817]
module.resources.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02d43da8b8a59983d]
module.resources.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-045eb5766c52522d3]
module.resources.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0cb15b3621112dd16]
module.resources.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=zeno-staging-cluster-cluster-20250423104012446600000002-20250423104036893800000014]
module.resources.aws_db_instance.eoapi: Refreshing state... [id=db-WJHTOX5LXUFRSOJXHKSED2VDLA]
module.resources.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e709e9a614ca4982]
module.resources.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=zeno-staging-cluster]
module.resources.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0b489d24e0ce753571080289494]
module.resources.module.eks.data.tls_certificate.this[0]: Reading...
module.resources.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.resources.module.eks.time_sleep.this[0]: Refreshing state... [id=2025-08-26T12:44:54Z]
module.resources.module.eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=4739490560680664532]
module.resources.module.eks.module.eks_managed_node_group["regular"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=7317963306366209068]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-060c1341fd5085052]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_launch_template.this[0]: Refreshing state... [id=lt-0f1c85b0fbe9c202f]
module.resources.kubernetes_secret.eoapi_db_credentials: Refreshing state... [id=eoapi/eoapi-db-credentials]
module.resources.kubernetes_secret.requester_pays_s3_credentials: Refreshing state... [id=eoapi/requester-pays-s3-credentials]
module.resources.kubernetes_secret.langfuse_s3_credentials: Refreshing state... [id=default/langfuse-s3-credentials]
module.resources.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
module.resources.module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
module.resources.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::084375562450:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/95005FA9F13DD1BDD5BBF6502423AC04]
module.resources.module.eks.module.eks_managed_node_group["regular"].aws_eks_node_group.this[0]: Refreshing state... [id=zeno-staging-cluster:regular-20250826140803724300000002]
module.resources.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=zeno-staging-cluster:default-2025042310495965280000001b]
module.resources.module.cluster_autoscaler_irsa.data.aws_iam_policy_document.this[0]: Reading...
module.resources.module.cluster_autoscaler_irsa.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2108724985]
module.resources.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=zeno-staging-cluster:aws-ebs-csi-driver]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.resources.module.cluster_autoscaler_irsa.aws_iam_policy.cluster_autoscaler[0] will be created
  + resource "aws_iam_policy" "cluster_autoscaler" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Cluster autoscaler policy to allow examination and modification of EC2 Auto Scaling Groups"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "AmazonEKS_Cluster_Autoscaler_Policy-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeNodegroup",
                          + "ec2:GetInstanceTypesFromInstanceRequirements",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeImages",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:DescribeScalingActivities",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:SetDesiredCapacity",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "autoscaling:ResourceTag/kubernetes.io/cluster/zeno-staging-cluster" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.resources.module.cluster_autoscaler_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/95005FA9F13DD1BDD5BBF6502423AC04:aud" = "sts.amazonaws.com"
                              + "oidc.eks.us-east-1.amazonaws.com/id/95005FA9F13DD1BDD5BBF6502423AC04:sub" = "system:serviceaccount:kube-system:cluster-autoscaler"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::084375562450:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/95005FA9F13DD1BDD5BBF6502423AC04"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "zeno-staging-cluster-cluster-autoscaler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.resources.module.cluster_autoscaler_irsa.aws_iam_role_policy_attachment.cluster_autoscaler[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_autoscaler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "zeno-staging-cluster-cluster-autoscaler"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @batpad, Action: `pull_request`*